WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
  return NULL;
}

//=============================================================
// This function will evaluate the GPIO based on 3 tables that contain the
// legal GPIOs for the CCM (all F7 GPIOs checked) and for F7v1 and F7v2.
// It returns the channel, 1-4 unless not found, then returns 0.
static uint8_t meadow_calc_freq_dc_validate_pin_port_combo(const int timerNumb,
          uint8_t portAndPin)
{
  int entry;
  int timerOffset = timerNumb - 1;

  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    // Verify pin & port are valid
    entry = 0;
    while(validGpioF7v1Array[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validGpioF7v1Array[timerOffset][entry])
      {
        syslog(1, "%s@%d- V1 so far good\n", __FILE__, __LINE__);
      }
      entry++;
    }
    if(validGpioF7v1Array[timerOffset][entry] == 0xff)
     return 0;
  }
  else if (meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2)
  {
    // Verify pin & port are valid
    entry = 0;
    while(validGpioF7v2Array[timerOffset][entry] != 0xff)
    {
      if(portAndPin == validGpioF7v2Array[timerOffset][entry])
      {
        break;    // So far good
      }
      entry++;
    }
    
    if(validGpioF7v2Array[timerOffset][entry] == 0xff)
      return 0;
  }
  else if (meadow_hw_version_get() != MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    // Unsupported device type
    syslog(1, "%s@%d- Unknown device type\n", __FILE__, __LINE__);
    return 0;
  }

  // All types are verified here too and pickup channel from this table
  entry = 0;
  while(validGpioCcmArray[timerOffset][entry].portPin != 0xff)
  {
    if(portAndPin == validGpioCcmArray[timerOffset][entry].portPin)
    {
      return validGpioCcmArray[timerOffset][entry].chan;
    }
    entry++;
  }

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called by Meadow.Core to configure
// Timer numbers range from 1 - 14. However, some are not defined.
int meadow_calc_freq_dc_freq_duty_config(const int timerNumber,
          const uint8_t portAndPin, const uint8_t gpioPolarity)
{
  int ret;
  uint32_t inputGpioConfig;
  static bool firstTime = true;

  if(firstTime)
  {
    firstTime = false;

    // (--) Diag config LED
    stm32_configgpio(DEBUG_PIN_V2_D06);
    // (--) Diag LED
  }

  // Insure a correct timer / pin+port combination was supplied.
  // Timers have, at most, 1-4 channels, each representing 1 GPIO. For the
  // specified timer we need to verify a proper port and pin.
  uint8_t chan = meadow_calc_freq_dc_validate_pin_port_combo(timerNumber, portAndPin);
  if(chan == 0)
  {
    syslog(2, "%s@%d-The GPIO and Timer combination not supported\n", __FILE__, __LINE__);
    return -ENOTSUP;
  }

  // Need to add

  // Check if there's already an object in this slot.
  struct freqDcTimerInfo_s *freqDcTimerInfo =
            meadow_calc_freq_dc_get_timer_info(timerNumber);
  if(freqDcTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer %ld not defined\n",
              __FILE__, __LINE__, timerNumber);
    return -ERROR;
  }

  if(freqDcTimerInfo->freqDcRtData != NULL)
  {
    syslog(LOG_ERR, "%s@%d-Already timer defined in slot.\n", __FILE__, __LINE__);
    return -ERROR;
  }

  // Enough to build the input configuration for the a GPIO
  inputGpioConfig = MEADOW_TIMER_GPIO_CONST | portAndPin | \
            freqDcTimerInfo->timerAltFunc;

  // Diagnostic
  // syslog(1, "%s@%d-input Pin defn:0x%02x (P%c%d), Pin defn + AF:0x%08lx\n",
  //           __FILE__, __LINE__, portAndPin,
  //           ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // Diagnostic

  // Valid GPIO so configure input point for timer.
  ret = stm32_configgpio(inputGpioConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    return -ENOTSUP;   // Not supported
  }

  // Allocate a new struct for each new timer to contain runtime data.
  freqDcTimerInfo->freqDcRtData = zalloc(sizeof(struct freqDcRtData_s));
  if(freqDcTimerInfo->freqDcRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Allocation for freqDcRtData_s NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }

  // Initialized the timer hardware
  ret = meadow_calc_freq_dc_init(freqDcTimerInfo);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow freq+dc init failed:%d\n", __FILE__, __LINE__, ret);
    free(freqDcTimerInfo->freqDcRtData);
    return ret;
  }

  // With a place to put the information, we can start filling the structure.
  freqDcTimerInfo->freqDcRtData->activeState     = MEADOW_FREQ_DC_FREQ_DC_SYNC_UNKNOWN;
  freqDcTimerInfo->freqDcRtData->inputPolarity   = gpioPolarity;
  freqDcTimerInfo->freqDcRtData->inputConfig     = inputGpioConfig;
  freqDcTimerInfo->freqDcRtData->countInputTotal  = 0;
  freqDcTimerInfo->freqDcRtData->countTimerTotal = 0;

  return OK;
}

//=============================================================
// Frequency and duty cycle measurement.
int meadow_calc_freq_dc_init(struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  // See RM0410 Reference manual for STM32F76xxx and STM32F77xxx section 26.3.6
  // for original concept.

  // A single input (T1) is used. It is configured as input to Compare/Capture
  // registers 1 and 2. For CCR1 it is configured to for leading edge interrupt
  // and trailing edge for CCR2. By using the count between interrupts for one
  // CCR's (i.e. leading to leading edges) the frequency can be found by
  // counting between interrupts from leading to trailing the duty cycle can be
  // found.

  int ret;
  uint16_t regVal16;
  uint32_t regVal32;
  uint32_t timerBase;

  timerBase = freqDcTimerInfo->timerBase;

  // Before starting disable capture/control for input 1 and 2 by setting CC1E
  // and CC2E to 0. Ref Man (26.4.7 at end) "Note: CC1S bits are writable only
  // when the channel is OFF (CC1E = 0 in TIMx_CCER)."
  regVal16 = getreg16(timerBase + STM32_GTIM_CCER_OFFSET);
  regVal16 &= 0xffcc;   // c = 1110, clear CC1E and CC2E bits 0 & 4
  putreg16(regVal16, timerBase + STM32_GTIM_CCER_OFFSET);

  // 1. Select the active input for TIMx_CCR1: write the CC1S bits to 01 in
  // the TIMx_CCMR1 register (TI1 selected).
  // Ref Man "01: CC1 channel is configured as input, IC1 is mapped on TI1."
  regVal32 = getreg32(timerBase + STM32_GTIM_CCMR1_OFFSET);
  regVal32 &= 0xfffffffc;   // c = 1100, clear CC1S bits 1:0
  regVal32 |= 0x00000001;   // 1 = 0001, set '01'
  putreg32(regVal32, timerBase + STM32_GTIM_CCMR1_OFFSET);

