WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
//=============================================================
// Called to unconfigure a timer
int meadow_calc_freq_dc_freq_duty_unconfig(const uint32_t timerNumber)
{
  struct freqDcTimerInfo_s *freqDcTimerInfo =
            meadow_calc_freq_dc_get_timer_info(timerNumber);

  // Is this slot being used?
  if(freqDcTimerInfo->freqDcRtData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Can't unconfigure, this timer %lu not configured.\n",
              __FILE__, __LINE__, timerNumber);
    return -EBADSLT;    // Invalid slot
  }

  // Stop interrupts
  up_disable_irq(freqDcTimerInfo->timerIrqVec);

  // Stop timer
  meadow_calc_freq_dc_disable(freqDcTimerInfo->timerBase);

  // Unconfigure GPIO
  stm32_unconfiggpio(freqDcTimerInfo->freqDcRtData->inputConfig);

  // Free runtime memory
  free(freqDcTimerInfo->freqDcRtData);
  freqDcTimerInfo->freqDcRtData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle information to caller.
int meadow_calc_freq_dc_return_freq_info(struct freqDcReturnData_s
          *returnData)
{
  double freq;
  double averageFreq;
  double dutyCycle;
  uint32_t retryCount = 0;
  uint32_t fullCycle;
  uint32_t halfCycle;
  double totalTimerCount;
  double inputTotalCount;
  
  // Just feed pulse train into appropriate GPIO
  struct freqDcTimerInfo_s *freqDcTimerInfo =
            meadow_calc_freq_dc_get_timer_info(returnData->timerNumber);
  struct freqDcRtData_s *freqDcRtData =
            (struct freqDcRtData_s *)freqDcTimerInfo->freqDcRtData;

  // Find valid data. That is, both full cycle and the half cycle values are
  // available. This is only an issue at higher frequencies.
  for(retryCount = 0; retryCount < 5; retryCount++)
  {
    // Get all the values at one time so once a valid value is found, a change
    // in the timer's data won't affect the output.
    // This would be nice if it was atomic
    fullCycle = freqDcRtData->countLeadToLead;
    halfCycle = freqDcRtData->countLeadToTrail;
    totalTimerCount = (double)freqDcRtData->countTimerTotal;
    inputTotalCount = (double)freqDcRtData->countInputTotal;

    if(fullCycle > 0 && halfCycle > 0)
      break;

    usleep(1 * 1000);   // delay for valid data
  }

  if(fullCycle > 0 && halfCycle > 0)
  {
    // Do floating point math and convert to integer times 1000.
    // Duty Cycle is the ratio of the full cycle count and the cycle count
    // before the trailing edge was detected.
    dutyCycle = (((double)halfCycle) * 100.0) / ((double)fullCycle);

    // The frequency is the timer's clock divided by the cycle count.
    freq = ((double)MEADOW_FREQ_DC_CLOCK_FREQ) / ((double)fullCycle);

    // Average frequency since last read
    double averageCount = totalTimerCount / inputTotalCount;
    averageFreq = ((double)MEADOW_FREQ_DC_CLOCK_FREQ) / averageCount;

    syslog(2, "In Code-Freq:%06.2fHz, DC:%02.2f%%, AvgFreq:%06.2f, Count:%lu, retries:%lu\n",
              freq, dutyCycle, averageFreq, inputTotalCount,
              retryCount);

    returnData->frequencyX1000  = (freq * 1000.0);
    returnData->avgFreqX1000    = (averageFreq * 1000.0);
    returnData->dutyCycleX1000  = (dutyCycle * 1000.0);
    returnData->countInputTotal = (uint32_t)inputTotalCount;
  }
  else
  {
    syslog(2, "Invalid data CCR1:%06lu, CCR2:%06lu, retries:%lu\n",
              fullCycle, halfCycle, retryCount);
  }

  // Prevent counts from being reused
  freqDcRtData->countLeadToLead   = 0;
  freqDcRtData->countLeadToTrail  = 0;
  freqDcRtData->countInputTotal   = 0;
  freqDcRtData->countTimerTotal   = 0;

  return OK;
}
#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
